# vi:set ft=ruby

tap "homebrew/cask"

brew "stow"             # symlink manager
brew "ripgrep"          # `grep` alternative
brew "zsh"              # shell
brew "coreutils"        # GNU coreutils
brew "eza"              # `ls` alternative
brew "fzf"              # fast fuzzy finder
brew "bat"              # pager with syntax highlighting
brew "tldr"             # like `man` but all examples
brew "htop"             # prettier `top`
brew "fd"               # `find` alternative
brew "wget"             # HTTP CLI
brew "entr"             # flexible file watcher
brew "jq"               # json query tool

brew "nvim"             # CLI editor
brew "gh"               # github CLI
brew "git-delta"        # syntax-highlighted git diffs
brew "direnv"           # directory-aware env vars
brew "mise"             # fast toolchain manager
brew "lazygit"          # git TUI

cask "zed"              # editor
cask "firefox"          # browser
cask "vlc"              # multimedia player
cask "slack"            # work chat
cask "spotify"          # music
cask "hammerspoon"      # desktop hacking with lua
cask "obsidian"         # note taking
cask "cleanshot"        # screen captures
cask "1password"        # password manager
cask "ghostty"          # terminal
