# vi:set ft=ruby

tap "homebrew/cask"

brew "nvim"
brew "stow"
brew "ripgrep"
brew "zsh"
brew "bat"
brew "fzf"
brew "tldr"
brew "htop"
brew "fd"
brew "wget"
brew "entr"
brew "coreutils"
brew "eza"
brew "gh"
brew "jq"
brew "gnupg"
brew "git-delta"
brew "direnv"
brew "mise"
brew "lazygit"

cask "zed"
cask "firefox"
cask "vlc"
cask "slack"
cask "spotify"
cask "hammerspoon"
cask "obsidian"
cask "cleanshot"
cask "1password"
cask "ghostty"
